In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({"EmpID": [1, 2, 3],
 "Name": ["Alice", "Bob", "Charlie"],
 "DeptID": [10, 20, 30]})
df1

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [3]:
df2 = pd.DataFrame({"DeptID": [10, 20, 40],
 "DeptName": ["HR", "Engineering", "Marketing"]})
df2

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [6]:
pd.merge(df1, df2, on = "DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [7]:
pd.merge(df1, df2, on = "DeptID", how = "left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [8]:
pd.merge(df1, df2, on = "DeptID", how = "right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [9]:
pd.merge(df1, df2, on = "DeptID", how = "outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

CONCATINATION

In [10]:
df3 = pd.DataFrame({"Name":["Alice","Bob"]})
df4 = pd.DataFrame({"Name":["Charlie","David"]})

In [12]:
pd.concat([df3, df4])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [13]:
pd.concat([df3, df4], axis=1)

    Name     Name
0  Alice  Charlie
1    Bob    David